app/controllers/movies_controller.rb

  def index
  session.clear
	@all_ratings = Movie.a_ratings
    if params["sort"] == "title" then
	session["sort"] = params["sort"]
	end
    if params["sort"] == "release_date" then
	session["sort"] = params["sort"]
	end
    if params["commit"] == "Refresh"
	session["ratings"] = params["ratings"]
	#session["sort"] = params["sort"]
	end

	@buttons = session["ratings"] ? session["ratings"] : @all_ratings
	@sort = session["sort"]
	if !@sort.nil? || !@buttons.nil?
		flash.keep
		redirect_to movies_path("sort" => @sort, "ratings" => @buttons) unless
		!params["ratings"].nil?  || !params["sort"].nil?
		#&& params["sort"].length>=1 && params["ratings"].length>=1
	end
    @movies = Movie.order(@sort)
    @movies = @movies.find_all_by_rating(@buttons.keys) unless @buttons.nil?
---
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17')